const article_tags = ["前端", "后端", "大数据", "小程序", "iOS"];

const article_title = [
  "设计模式大冒险第三关：工厂模式，封装和解耦你的代码",
  "你可能不知道的Animation动画技巧与细节",
  "经常被提到的缓存穿透、雪崩和击穿到底是什么？",
  "面试官：select、poll、epoll有何区别？我：阿巴阿巴...",
  "H5常遇见的问题———移动端1px解决（完整版）",
  "Zilliz融资4300万美元，创全球开源基础软件B轮融资新纪录",
  "2019 Google 开发者大会上的这些 ARCore 更新，让 AR 技术更接地气",
  "聊聊IO多路复用之select、poll、epoll详解",
  "javaScript 这些常用的代码块你知道多少？",
  "7个分会场 60+ 议题，亚洲最大开发者关系大会 DevRel/Asia 2020 即将召开",
  "CentOS 搭建 V-P-N 服务，实现虚拟专用网络",
  "保证接口的安全性，开放 HTTP API 接口签名验证！",
  "玩Android（flutter + fish_redux）",
  "C/C++Linux后台开发(入门到精通) 学习路线-架构师篇",
  "小程序依赖分析实践",
  "商家如何在双十一薅天猫的的流量羊毛",
  "基于云开发搭建 KV 缓存系统 2.0",
  "如何在云开发中搭建 KV 缓存系统",
  "键盘设置如何优化小程序使用体验?",
  "Flutter 实战：增删查改功能示例代码",
  "在 Android 和 Hilt 中限定作用域",
  "减少崩溃，提升体验 | 使用 Kotlin 打造优质应用",
  "R8 编译器: 为 Kotlin 库和应用瘦身",
  "深入探索 Android Gradle 插件的缓存配置",
  "你的开发利器Spring自定义注解",
];

const article_content = `
我们经常在框架级的源码中看到类似如下的一句代码比如后台开发入门到精通)学习路线架构师篇键盘设置如何优化小程序使用体验?它是百度智能小程序官方提供的代码开发工具为小程序开发提供了大量的针对性优化功能如小程序的代码高亮代码提示代码模板云函数组件面板自动文件生成等这些百度开发者工具编辑器特有的深入探索插件的缓存配置实现边到边的体验让您的软键盘动起来中的新功能之一是可以让应用在对于屏幕上的软键盘打开和关闭的过程创建无缝过渡的动画效果这一功能源自的大量改进是中提供的一个新组件它可以帮我们顺序地组合多个并让它们显示在同一个中这使您可以更好地封装我们手上是一个很成熟的项目所以毫无疑问需要保留代码目前只会在新开发的页面中使用并已经感受到了它带来的便利随着功能的迭代，我们相信更多的功能会
`;

module.exports = { article_title, article_tags, article_content };

const course_tags = {};
